_posts/2025-10-29-test-auto-header.html
---
layout: post
title: "Test Post with Automatic Header Generation"
date: 2025-10-29 11:00
author: Test Author
categories: test automation
tags: org-mode automation jekyll
---

<div id="outline-container-org4223215" class="outline-2">
<h2 id="org4223215"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This post demonstrates the automatic generation of Jekyll front matter from org-mode properties.
</p>

<p>
Instead of manually writing a <code>#+BEGIN_EXPORT html</code> block with Jekyll front matter, the system now automatically extracts metadata from org properties:
</p>

<ul class="org-ul">
<li><code>#+TITLE:</code> becomes the post title</li>
<li><code>#+DATE:</code> becomes the post date</li>
<li><code>#+JEKYLL_LAYOUT:</code> specifies the layout (defaults to "post")</li>
<li><code>#+JEKYLL_CATEGORIES:</code> specifies categories</li>
<li><code>#+JEKYLL_TAGS:</code> specifies tags</li>
</ul>
</div>
</div>

<div id="outline-container-org94c0878" class="outline-2">
<h2 id="org94c0878"><span class="section-number-2">2.</span> Features</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org0bba794" class="outline-3">
<h3 id="org0bba794"><span class="section-number-3">2.1.</span> Clean Org Syntax</h3>
<div class="outline-text-3" id="text-2-1">
<p>
No more ugly export blocks at the beginning of your posts!
</p>
</div>
</div>

<div id="outline-container-org36989c3" class="outline-3">
<h3 id="org36989c3"><span class="section-number-3">2.2.</span> Standard Org Properties</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Uses standard org-mode properties that work well with other org tools.
</p>
</div>
</div>

<div id="outline-container-org27c90b1" class="outline-3">
<h3 id="org27c90b1"><span class="section-number-3">2.3.</span> Automatic Processing</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The front matter is automatically generated during the publishing process.
</p>
</div>
</div>
</div>

<div id="outline-container-org97f2cd0" class="outline-2">
<h2 id="org97f2cd0"><span class="section-number-2">3.</span> Conclusion</h2>
<div class="outline-text-2" id="text-3">
<p>
This makes writing Jekyll posts in org-mode much more natural and maintainable.
</p>
</div>
</div>
